// _________________________________________________task1______________________________
let age = 24;
let hasSecurityPass = true;
let isBlackListed = false;
let clearanceLevel = 3; // المدى الصحيح من 1 إلى 5

// اذا كان المستخدم موجودًا في القائمة السوداء (isBlacklisted = true)
//  → اطبع: "تم رفض الدخول: المستخدم محظور."


if (isBlackListed ===true) {
    console.log("تم رفض الدخول: المستخدم محظور");
} 

// إذا كان عمر المستخدم أقل من 18 أو لا يحمل بطاقة تصريح
//  → اطبع: "تم رفض الدخول: الشروط الأساسية غير مكتملة."


else if (age < 18 || !hasSecurityPass ===true) {
    console.log("تم رفض الدخول: الشروط الأساسية غير مكتملة.");
}

// إذا اجتاز المستخدم الشروط السابقة وكان مستوى التصريح أكبر أو يساوي 4
//  → اطبع: "تم السماح بالدخول: صلاحية كاملة."



else if (clearanceLevel >=4) {
    console.log("تم السماح بالدخول : صلاحية كاملة.");
}

// ذا كان مستوى التصريح بين 2 و 3
//  → اطبع: "تم السماح بالدخول: صلاحية محدودة."

else if (clearanceLevel >=2 && clearanceLevel <= 3) {
    console.log("تم السماح بالدخول: صلاحية محدودة");
}   

// إذا كان مستوى التصريح 1
//  → اطبع: "تم السماح بالدخول: صلاحية زائر فقط."

else if (clearanceLevel === 1){
    console.log("تم السماح بالدخول: صلاحية زائر فقط");
}