// // ______________________________________________________________task2_________________________________
// // _______________________

let score = 78;  // 0 إلى 100
let attendance = 82; // نسبة الحضور 
let cheatingFlag = false;

// // _______- إذا كانت قيمة  cheatingFlag = true
//  → اطبع: "النتيجة: مستبعد بسبب الغش."

if (cheatingFlag == true) {
    console.log("النتيجة: مستبعد للغش.");
}

// - إذا كانت نسبة الحضور أقل من 60 %
//  → اطبع: "النتيجة: راسب بسبب انخفاض الحضور."

else if (attendance <= 60) {
    console.log("النتيجة: راسب بسبب انخفاض الحضور.");
}

// تقييم الدرجات___
else if (score >= 70 && score <= 79) {
    console.log("الدرجة: C");
}
else if (score >= 80 && score <= 89) {
    console.log("الدرجة: B");
}
else if (score >= 90) {
    console.log("الدرجة: A");
}
else {
    console.log("الدرجة: F");
}

// شرط إضافي:
//  إذا كانت الدرجة 70 أو أكثر ونسبة الحضور 90 % أو أكثر
//  → اطبع: "الحالة: مؤهل للتميزالأكاديمي

if (score >= 70 && attendance >= 90) {
    console.log("الحالة: مؤهل للتميز الأكاديمي.");
}